[net]
batch=50
subdivisions=1
depth=32
height=32
width=32
channels=1
momentum=0.9
decay=0.0003
max_crop=50

learning_rate=0.01
policy=poly
power=4
max_batches=40000

[convolutional]
filters=32
size=5
stride=1
pad=1
activation=leaky

[convolutional]
filters=32
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[connected]
output=128
activation=leaky

[connected]
output=10
activation=leaky

[softmax]
groups=1

[cost]
type=sse

